| Selector | Stands For       | Selects By                           | Inclusive? |
| -------- | ---------------- | ------------------------------------ | ---------- |
| `loc`    | location         | **labels** (row names, column names) | Yes        |
| `iloc`   | integer location | **indexes** (row/column positions)   | Yes        |

# ðŸ§  Very simple memory trick

* loc = label
* iloc = index

# update a values in the exiting dataframe

update a values by using the df.loc[index number, column name] = data

In [13]:
import pandas as pd 
data = {
"Name"  : ['yash','yash vardhan','tanya','tushi','mohit','monu','shinchan','nobitha','doremone'],
"age"   : [21,23,20,18,25,26,45,22,30],   # Note: these are strings, not numbers
"salary":[101000,100000,10000,20000,150,12000,15000,25000,30000],
"work"  : ['data science','data analyst','sales executive','accounted','swiper','hardware Engineering',
           'maneger','bank maneger','scientest']
}
df = pd.DataFrame(data)
print(df)
df.loc[4,'salary'] = 10000 # singel modification 
print("modify data frame in the mohit :-")
print(df)
df['salary'] = df['salary'] * 1.56  # modificaion in all the list of spacific column 
print("modify in all the spacific row:-")
print(df)

           Name  age  salary                  work
0          yash   21  101000          data science
1  yash vardhan   23  100000          data analyst
2         tanya   20   10000       sales executive
3         tushi   18   20000             accounted
4         mohit   25     150                swiper
5          monu   26   12000  hardware Engineering
6      shinchan   45   15000               maneger
7       nobitha   22   25000          bank maneger
8      doremone   30   30000             scientest
modify data frame in the mohit :-
           Name  age  salary                  work
0          yash   21  101000          data science
1  yash vardhan   23  100000          data analyst
2         tanya   20   10000       sales executive
3         tushi   18   20000             accounted
4         mohit   25   10000                swiper
5          monu   26   12000  hardware Engineering
6      shinchan   45   15000               maneger
7       nobitha   22   25000          bank maneger
8      doremone   30   30000             scientest
modify in all the spacific row:-
           Name  age    salary                  work
0          yash   21  157560.0          data science
1  yash vardhan   23  156000.0          data analyst
2         tanya   20   15600.0       sales executive
3         tushi   18   31200.0             accounted
4         mohit   25   15600.0                swiper
5          monu   26   18720.0  hardware Engineering
6      shinchan   45   23400.0               maneger
7       nobitha   22   39000.0          bank maneger
8      doremone   30   46800.0             scientest

# loc Location

In [14]:
df

           Name  age    salary                  work
0          yash   21  157560.0          data science
1  yash vardhan   23  156000.0          data analyst
2         tanya   20   15600.0       sales executive
3         tushi   18   31200.0             accounted
4         mohit   25   15600.0                swiper
5          monu   26   18720.0  hardware Engineering
6      shinchan   45   23400.0               maneger
7       nobitha   22   39000.0          bank maneger
8      doremone   30   46800.0             scientest

In [15]:
df.columns

Index(['Name', 'age', 'salary', 'work'], dtype='object')

# extract the single row

In [16]:
df.loc[0]

Name              yash
age                 21
salary        157560.0
work      data science
Name: 0, dtype: object

# multiply row

In [17]:
df.loc[[0,1]]

           Name  age    salary          work
0          yash   21  157560.0  data science
1  yash vardhan   23  156000.0  data analyst

# extract row and columns

In [18]:
df.loc[0,'age']

np.int64(21)

# iloc fuction extract the data by index lebeling

In [19]:
df.iloc[0]

Name              yash
age                 21
salary        157560.0
work      data science
Name: 0, dtype: object

In [20]:
df.iloc[0,1] # row ,column

np.int64(21)

In [21]:
df.iloc[[0,3]]

    Name  age    salary          work
0   yash   21  157560.0  data science
3  tushi   18   31200.0     accounted

In [22]:
df.iloc[0:3]

           Name  age    salary             work
0          yash   21  157560.0     data science
1  yash vardhan   23  156000.0     data analyst
2         tanya   20   15600.0  sales executive

In [23]:
df.iloc[2:4]

    Name  age   salary             work
2  tanya   20  15600.0  sales executive
3  tushi   18  31200.0        accounted

# modification using this loc and iloc fuction

In [24]:
df

           Name  age    salary                  work
0          yash   21  157560.0          data science
1  yash vardhan   23  156000.0          data analyst
2         tanya   20   15600.0       sales executive
3         tushi   18   31200.0             accounted
4         mohit   25   15600.0                swiper
5          monu   26   18720.0  hardware Engineering
6      shinchan   45   23400.0               maneger
7       nobitha   22   39000.0          bank maneger
8      doremone   30   46800.0             scientest

In [34]:
df.loc[0,'Name'] = 'tanisha'

In [35]:
df

           Name  age    salary                  work
0       tanisha   21  157560.0          data science
1  yash vardhan   23  156000.0          data analyst
2         tanya   20   15600.0       sales executive
3         tushi   18   31200.0             accounted
4         mohit   25   15600.0                swiper
5          monu   26   18720.0  hardware Engineering
6      shinchan   45   23400.0               maneger
7       nobitha   22   39000.0          bank maneger
8      doremone   30   46800.0             scientest

In [39]:
df.loc[0:3,'age'] = [20,20,20,20]
df

           Name  age    salary                  work
0       tanisha   20  157560.0          data science
1  yash vardhan   20  156000.0          data analyst
2         tanya   20   15600.0       sales executive
3         tushi   20   31200.0             accounted
4         mohit   25   15600.0                swiper
5          monu   26   18720.0  hardware Engineering
6      shinchan   45   23400.0               maneger
7       nobitha   22   39000.0          bank maneger
8      doremone   30   46800.0             scientest

# update values using the iloc

In [45]:
df.iloc[:,2] = [2222,333,444,55,53654,2456342,3456456,2984356,435]
df

           Name  age     salary                  work
0       tanisha   20     2222.0          data science
1  yash vardhan   20      333.0          data analyst
2         tanya   20      444.0       sales executive
3         tushi   20       55.0             accounted
4         mohit   25    53654.0                swiper
5          monu   26  2456342.0  hardware Engineering
6      shinchan   45  3456456.0               maneger
7       nobitha   22  2984356.0          bank maneger
8      doremone   30      435.0             scientest